{
    "@odata.type": "#microsoft.graph.androidForWorkWiFiConfiguration",
    "displayName": "Android WiFi Profile",
    "identityCertificate": {
      "keyType": "useUserCredential"
    },
    "ssid": "YourWiFiSSID",
    "authenticationMethod": "user"
  }
  